{
  "title": "BuzzFeed",
  "subtitle": "A digital media company",
  "sections": [
    {
      "title": "Native Instream Video Unit",
      "details": [
        "I helped build a new ad unit to live on BuzzFeed O&O properties. A large selection of units is attractive to potential advertisers, especially video ones, so I developed a Native Instream Video Unit for my intern project.",
        "The new unit includes a custom video player and a playlist of BuzzFeed videos. It also includes a \"More Info\" button in case users want to watch more vidoes.",
        "The video player would pull in a pre-roll ad before playing the selected BuzzFeed video. The banner at the top displays the logo of BuzzFeed Brand that owns the video. This unit helped bring in over 750K+ in ad revenue."
      ]
    },
    {
      "title": "BAM (BuzzFeed Ad Manager)",
      "details": [
        "I helped build an internal ad manager for the business team to organize ad campaigns for various companies. The users could upload assests and change settings to preview a variety of ad units before the campaign was finalized.",
        "I used React.js to add support for two ad units. This includes an editing and previewing environment with a text editor and various swtiches/settings.",
        "This project saved time for business team, kept them organized and allowed them to manage a higher volume of ads."
      ]
    },
    {
      "title": "Chinstrap",
      "details": [
        "The Chinstrap is a banner that displays when users visit a page on buzzfeednews.com. It's used to promote articles, series, podcasts, our membership program, etc.",
        "My responsibilities included using html and css to build banners that matched the designs as well as vetting them for any accessibiity issues, such as insufficient contrast.",
        "Originally the Chinstrap displayed for every user anytime they visited a page unless they manually dismissed it. Most visitors on buzzfeed will view one page and leave, so this made sense at the time. We decided to take a new approach to the Chinstrap because we planned to build a more loyal, invested audience.",
        "I added new logic for the Chinstrap to make it less intrusive and more user-friendly. I made the Chinstrap display only after a user had scrolled through over 50% of the article they we're reading. That way we could disrupt fewer readers and promote to people who are the most interested. We also made sure the popup disappeared for at least a week after being dismissed. By the time the user saw the popup again, it would most likely be promoting something new.",
        "Popup is not visible on page load/nPopup appears when user scrolls down and scrolls back up\nPopup appears when user clicks another tab or window, and returns\nPopup doesn't appear when user is a member of Scroll.com\nPopup disappears for a week when it is dismissed by user",
        "as the accessibility lead, I also vetted designs that didn't have enough contrast or fonts that weren't accessible enough"
      ]
    },
    {
      "title": "Trending/Breaking Bar",
      "details": [
        "trending bar and breaking bar took up the same slot on the page. breaking bar replaced trending bar whenever there was breaking news. site users couldn't access the site sections menu, the tips page, support us page, or trending topics",
        "Users can access trending tags menu when there’s breaking news",
        "python api, javascript",
        "fixed bug where the breaking news bar and trending bar couldn't be on the page at the same time. also edited api endpoints (they were coupled)"
      ]
    },
    {
      "title": "FinCEN Files",
      "details": [
        "Help promote finCEN files investigation that buzzfeed had been working on for years",
        "New landing page",
        "Spread the word a lot",
        "5 custom packages for each number of articles (1 - 5)",
        "Homebuilder updates for custom package",
        "Curator updates for the new data source",
        "mostly html css"
      ]
    },
    {
      "title": "Election 2020",
      "details": [
        "Used third party for voting results",
        "Display election information and results in a helpful, easy to understand, and meaningful way",
        "Showed millions of people election information during a historical election"
      ]
    },
    {
      "title": "Branch IO",
      "details": [
        "Increase app downloads",
        "Branch popup would show halfway down page",
        "Would disappear",
        "Use branch.io banner to direct mobile users on bpages to BuzzFeed App. This will replace the chinstrap promo unit.",
        "kinda sucked using small third party software",
        "javascript mutation observer"
      ]
    },
    {
      "title": "CCPA",
      "details": [
        "connnect to third party thing",
        "desgined button and placement",
        "tested with vpn"
      ]
    },
    {
      "title": "Accessibility Team",
      "details": [
        "Editorial Survey",
        "BuzzFeed News Audit",
        "Lead that meeting with edit leaders",
        "Workshops for alt-text editorial",
        "In house expert"
      ]
    }
  ]
}
