{
  "title": "BuzzFeed",
  "subtitle": "A digital media company",
  "sections": [
    {
      "title": "Native Instream Video Unit",
      "details": [
        "I helped build a new ad unit to live on BuzzFeed O&O properties. Potential advertisers love a large selection of ad units, especially video ones, so I developed a Native Instream Video Unit for my intern project.",
        "The new unit includes a custom video player and a playlist of BuzzFeed videos. It also includes a \"More Info\" button in case users want to watch more vidoes.",
        "The video player would pull in a pre-roll ad before playing the selected BuzzFeed video. The banner at the top displays the logo of BuzzFeed Brand that owns the video. This unit helped bring in over $750k in ad revenue."
      ]
    },
    {
      "title": "BAM (BuzzFeed Ad Manager)",
      "details": [
        "I helped build an internal ad manager for the business team to organize ad campaigns for various companies. The users could upload assests and change settings to preview a variety of ad units before the campaign was finalized.",
        "I used React.js to add support for two ad units. This included an editing and previewing environment with a text editor and various swtiches/settings.",
        "This project saved time for business team, kept them organized and allowed them to manage a higher volume of ads."
      ]
    },
    {
      "title": "Chinstrap",
      "details": [
        "The Chinstrap is a banner that displays when users visit a page on buzzfeednews.com. It's used to promote articles, series, podcasts, our membership program, etc.",
        "My responsibilities included using html and css to build banners that matched the designs as well as vetting them for any accessibiity issues, such as insufficient contrast.",
        "Originally the Chinstrap displayed for every user anytime they visited a page unless they manually dismissed it. Most visitors on BuzzFeed will view one page and leave, so this made sense at the time. We decided to take a new approach to the Chinstrap because we planned to build a more loyal, invested audience.",
        "I added new logic for the Chinstrap to make it less intrusive and more user-friendly. I made the Chinstrap display only after a user had scrolled through over 50% of the article they we're reading. It would also appear if the user scrolled up or if they went to another tab and returned.",
        "That way we could disrupt fewer readers and promote to people who are the most interested. We also made sure the popup disappeared for at least a week after being dismissed. By the time the user saw the popup again, it would most likely be promoting something new."
      ]
    },
    {
      "title": "Trending/Breaking Bar",
      "details": [
        "When there's breaking news on buzzfeed.com, a unit called the Breaking Bar is shown at the top of all BuzzFeed and BuzzFeed News pages. This unit includes information on the breaking news item and a link to a relevant article.",
        "The problem with the Breaking Bar is that it took up the same slot as another unit - the Trending Bar. The Trending Bar displayed links to articles that were trending on our website at that time, as well as a link to login and our sections menu.", 
        "Anyone who wanted to login, look at popular articles, or view other sections of BuzzFeed News wouldn't be able to.",
        "I redesigned the page to allow both units to exist simultaneously using html, css, and javascript. I also modified our python API to allow the data streams for the Trending and Breaking bar to be consumed separately instead of in that one unit."
      ]
    },
    {
      "title": "FinCEN Files",
      "details": [
        "The FinCEN files was a Pulitzer Prize winning, years long investigation conducted by BuzzFeed reporters that revealed corruption among the world's most powerful banks.",
        "My team built custom assets to market the investigation across BuzzFeed O&O properties including: a new landing page, chinstrap, a custom splash header, and 5 custom packages for each number of articles.",
        "In this case, a \"package\" is a collection of links that share a theme (seen in images below).",
        "I used html, css, and javascript to build the packages, chinstrap, and custom splash header design.",
        "I also used python to create a new data source, and send information about the feed to the necessary pages.",
        "This was a fullstack project - I worked with our database as well as frontend and backend services.",
        "This project was extremely impactful and the story was responsible for dropping the DOW 500 points."
      ]
    },
    {
      "title": "News Ticker",
      "details": [
        "The News Ticker is a scrolling banner that can show users a collection of articles on any page of BuzzFeed O&O properties.",
        "A previous version of the News Ticker used a data source that had since been decommisioned, so I was tasked to connect it to our current backend data source.",
        "I created a new data feed for the Ticker, and updated the data mappings along the data flow.",
        "This project helped support the 2020 election news cycle because reporters could display relevant election articles together."
      ]
    },
    {
      "title": "Election 2020",
      "details": [
        "Every presidential election is a major news event for publications, and the 2020 election was no different.",
        "My team created custom assets and a new landing page to display election information and results in a helpful, easy to understand, and meaningful way.",
        "We connected to a third party for voting results, and built a unit on the homepage to show which candidate was winning in real time.",
        "In addition, I made a custom election themed QCU (Quickly Catch Up) unit and chinstrap promotion.",
        "We kept millions of people informed during a historical election."
      ]
    },
    {
      "title": "Branch IO",
      "details": [
        "My team invested in a popup to direct mobile users to our app so we could increase app downloads.",
        "I worked with a third party service called Branch.io to handle the logic to get from the link to the app.",
        "The popup would be triggered if a user scrolled past the halfway point of an article - we only wanted to convert engaged readers.",
        "I used cookies to hide the popup for 7 days once the user interacted with it.",
        "And I used the javascript mutation observer to add the clicks in the Branch.io iframe to our internal tracking service. (The event listener provided by Branch.io fired too early.)"
      ]
    },
    {
      "title": "CCPA",
      "details": [
        "New privacy regulations require us to give California residents the option to opt-out of cookies.",
        "Since, these residents might be visiting our site from other states, we decided to give anyone in the US the ability to opt-out of cookies.",
        "I designed and picked the placement for the CCPA button.",
        "The button connected to a third party that gave users access to privacy options depending on their location (CCPA or GDPR).",
        "I tested functionality per locale with a VPN before releasing this feature."
      ]
    },
    {
      "title": "Accessibility Team",
      "details": [
        "I served on the accessibility engineering group and was the resident accessibilty expert for my team.",
        "The group met regularly to identify and address accessibility issues on all BuzzFeed O&O properties.",
        "I made and distributed an editorial survey to gather information about the current state of accessibility.",
        "Then, I completed a BuzzFeed News accessibility audit to report to an accessibility compliance service (Accessible360).",
        "I also lead meetings with editorial leaders to brainstorm alt-text writing exercises for reporters."
      ]
    }
  ]
}
